{
    "Ibuprofen":{
        "desc":"When youre menstruating, your body produces the prostaglandin, which causes the contractions in the uterus. The contractions help your body to shed the lining of your uterus. Ibuprofen slows down prostaglandin production. Less prostaglandin means less uterine shedding, leading to fewer cramps and less bleeding. ",
        "image":"https://i5.peapod.com/c/DN/DNKLZ.png",
        "video":"e9gbZkJ9too"

    },
    "Ginger_tea":{
        "desc":"1.Add sliced or chopped ginger to 4 cups of boiling water 2.Steep for 5 to 10 minutes. Steeping longer will give it a stronger flavor 3.Remove from heat and flavor with lemon juice, honey, or sugar.",
        "image":"https://static.toiimg.com/thumb/resizemode-4,width-1200,height-900,msid-69376628/69376628.jpg",
        "video":"nASg3fVe60c"
    },
    "ajwan":{
        "desc":"Take Ajwain Tea for relief in the muscular cramps.Add 2 generous pinches of Ajwain in 2cups of water and boil it until it reduces to half. Strain add honey and drink two to three times a day.",
        "image":"r85KIzeL4q8"
    },
    "methi":{
        "desc":"Soak a teaspoon of Methi in a glass or normal water overnight. Next morning, drink it whole with the seeds if possible, or you may choose to strain the seeds out. Mix a small pinch of black salt if you wish.",
        "image":"http://t1.gstatic.com/licensed-image?q=tbn:ANd9GcRxpLmn0QxGN2VJ2BGWHGnMskIjsARtENKtFDSOCmevg6jVqbUAq2xjWCzxYcHJr-qe4dA2QrXbIMGURLU"
    },
    "aloevera":{
        "desc":"Aloe is a womans best friend.Drink a glass of aloe vera juice on an empty stomach every morning and you will see your health improving drastically. If you can’t take it daily, then consider drinking it 3 to 5days before cramps set it. You can continue drinking it throughout your periods.",
        "image":"https://m.media-amazon.com/images/I/61R3JErHxtL._SX679_.jpg"
    },
    "ColdTherapy":{
        "desc":"Wrap an ice pack in a towel and apply it to your forehead (10 minutes on, 10 minutesoff).Cold therapy can reduce inflammation and dull the sensation of pain.",
        "image":"http://www.herculife.com/image/Blog%20Images/Woman-sleeping-with-bag-of-ice-on-her-head.jpg"
    },
    "Sleep":{
        "desc":"Take your bedsheet slowly ,take your pillow  and slowly close your eyes!.Too little sleep can make headaches worse. Aim for at least seven to nine hours of sleep each night. Improve your sleep environment for better rest. Turn off the TV and lights, and keep your room at a comfortable temperature.",
        "image":"https://www.sleepfoundation.org/wp-content/uploads/2022/04/Eight-Health-Benefits-of-Sleep.jpg"
    },
    "Primrose-Oil":{
        "desc":"In the body, GLA interferes with the production of inflammatory prostaglandins released during menstruation and so can offer some relief from menstrual cramps, as well as bloating, headaches and breast tenderness.",
        "image":"https://media.istockphoto.com/id/1013785958/photo/a-bottle-of-evening-primrose-oil-with-fresh-blooming-evening-primrose.jpg?s=612x612&w=0&k=20&c=O2wJrx1h_995m-r75f-mPxH_p8tsHypNXcPClL9J26M="
    },
    "Chasteberry":{
        "desc":"Chasteberry has consistently shown promise in relieving symptoms in women with PMS. A double-blind, placebo-controlled study of 178 women found that treatment with chasteberry over three menstrual cycles significantly reduced general PMS symptoms. The dose used was 1 tablet 3 times daily of a dry chasteberry extract.",
        "image":"https://st4.depositphotos.com/1012047/27990/i/600/depositphotos_279901148-stock-photo-vitex-agnus-castus-chaste-tree.jpg"
    },
    "Turmeric":{
        "desc":"Turmeric has anti-inflammatory properties which makes it effective against cramps. The bioactive compound, curcumin present in turmeric actually works against period cramps.",
        "image":"https://cdn-prod.medicalnewstoday.com/content/images/articles/318/318405/turmeric-root-and-powder.jpg"
    },
    "Ashwaganda":{
        "desc":"Several studies highlight the benefits of ashwagandha supplements in decreasing stress and anxiety levels by lowering the cortisol level.Ashwagandha helps women experience significant relief from chronic stress symptoms like extreme fatigue, insomnia, etc. Ayurvedic texts also recommend using ashwagandha for alleviating tension, exhaustion, and body ache.",
        "image":"https://m.media-amazon.com/images/I/61eNW65rU0L._SL1200_.jpg"
    },
    "ginger":{
        "desc":"A study found that ginger for period pain is one of the most beneficial things it can be as effective as ibuprofen and other over-the-counter medicine in relieving menstrual cramps.During periods, the prostaglandin hormone sets of muscle contracts in the uterus. The contraction causes inflammation and pain. The cramps cause discomfort, and pain often radiates to the lower back, leading to bloating, headaches, nausea, vomiting, or sometimes diarrhea.",
        "image":"https://m.media-amazon.com/images/I/61SCxbFGpWL._SX679_.jpg"
    },
    "honey":{
        "desc":"Honey consumption in women, who suffer from primary dysmenorrhea, reduces significantly the severity of pain and amount of bleeding. It can be considered as an alternative treatment approach in affected women.",
        "image":"https://images.livemint.com/img/2020/12/07/1140x641/iStock-1093966734_Web_1607336088089_1607336105455.jpg"
    },
    "compresses":{
        "desc":"Pain, including lower back pain, during menstruation can be caused by a few different factors.The American College of Obstetricians and Gynecologists notes that dysmenorrhea is the most commonly reported menstrual disorder. Roughly half of people who menstruate experience pain for at least one or two days per menstrual cycle.There are two kinds of period pain: primary dysmenorrhea and secondary dysmenorrhea.",
        "image":"https://embed.widencdn.net/img/veritas/zlijkcm1vk/1200x675px/woman-receiving-heat-therapy-back.webp"
    },
    "Nolvadex":{
        "desc":"Tamoxifen is an antiestrogen drug. It blocks estrogen activity in your breast. This may help stop the growth of breast tumors that need estrogen to multiply.",
        "image":"https://cpimg.tistatic.com/02443917/b/4/Tamoxifen-Tablets.jpg"
    },
    "Massage":{
        "desc":"Turmeric has anti-inflammatory properties which makes it effective against cramps. The bioactive compound, curcumin present in turmeric actually works against period cramps.",
        "image":"Massage benefits can include: Reducing stress and increasing relaxation. Reducing pain and muscle soreness and tension. Improving circulation, energy and alertness. Lowering heart rate and blood pressure. Improving immune function"
    },
    "Veggies":{
        "desc":"It's common to experience a dip in your iron levels during your period, particularly if your menstrual flow is heavy. This can lead to fatigue, bodily pain, and dizziness. Leafy green vegetables such as kale and spinach can boost your iron levels. Spinach is also rich in magnesium.",
        "image":"https://www.cspinet.org/sites/default/files/styles/og_image/public/2021-12/fruitsVeggies_landing_hero_1440x465.jpg?itok=NYPV13GG"
    },
    "Rock-salt":{
        "desc":"Mix the juice of one lemon with two teaspoons of Himalayan Pink Salt crystals in a glass of water. You’ll feel the pain becoming less intense after drinking the entire glass. Himalayan Pink Salt is effective in treating menstrual cramps too. The common cause of cramps is a deficiency of magnesium. To relieve cramps, put half a cup of Himalayan Pink Salt in warm water and add it to your bath water for a few days before cramping usually occurs.",
        "image":"https://post.healthline.com/wp-content/uploads/2019/12/pink-rock-salt-1200x628-facebook.jpg"
    },
    "Garlic":{
        "desc":"Our findings highlight the potential effect of garlic in reducing the severity of premenstrual symptoms; therefore, the use of garlic can be considered as an alternative therapy in the prevention and treatment of premenstrual disorders.",
        "image":"https://images.healthshots.com/healthshots/en/uploads/2022/07/14214621/garlic1-1600x900.jpg"
    },
    "Ginger":{
        "desc":"A study found that ginger for period pain is one of the most beneficial things; it can be as effective as ibuprofen and other over-the-counter medicine in relieving menstrual cramps.During periods, the prostaglandin hormone sets of muscle contracts in the uterus. The contraction causes inflammation and pain. The cramps cause discomfort, and pain often radiates to the lower back, leading to bloating, headaches, nausea, vomiting, or sometimes diarrhea.",
        "image":"https://m.media-amazon.com/images/I/61SCxbFGpWL._SX679_.jpg"
    },
    "garlic":{
        "desc":"Our findings highlight the potential effect of garlic in reducing the severity of premenstrual symptoms; therefore, the use of garlic can be considered as an alternative therapy in the prevention and treatment of premenstrual disorders.",
        "image":"https://images.healthshots.com/healthshots/en/uploads/2022/07/14214621/garlic1-1600x900.jpg"
    }

}